---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveEdgeOffset
source: html/36d0303d-0435-d6b5-9e99-01fdd4e39ba0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveEdgeOffset Property

"Wall offset"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveEdgeOffset { get; }
```